const texts = {
  version: `\n> *الإصدار:* 𝑲𝒆𝒏𝒋𝒂𝒌𝒖-V1 \n> *المطور:* @m10_1u`,
  test: `⛔⛔⛔`,
  privateMention: `#`,
  botDesc: `> *𝑲𝒆𝒏𝒋𝒂𝒌𝒖-V1* Just a bot.`,
  botName: "𝑲𝒆𝒏𝒋𝒂𝒌𝒖",
  dev: "بواسطة 𝓀𝑒𝓃",
  isWorking: `𝑲𝒆𝒏𝒋𝒂𝒌𝒖 يعمل الآن\n`,
  defender: `تم اكتشاف خطأ بواسطة 𝑲𝒆𝒏𝒋𝒂𝒌𝒖`,
  errorIslid: `⚠️ *لا يمكن تنفيذ هذا الإجراء في المجموعة الحالية.*`,
  spyTitle: `⛔⛔⛔⛔:`,
  linkGenerated: "Link created :",
  notAdmin: `⚠️ *أنت لست مشرفًا في هذه المجموعة !!*`,
  invalidLink: `⚠️ *الرابط غير صالح !!*`,
  checkGroupWithLinkTool: "*أداة فحص المجموعة V1*",
  linkedVmax: "*فحص الروابط V-2*",
  linkedCheck: "*فحص الروابط المرتبطة*",
  warningBotLinked: "قد نكون مرتبطين ببوتات مخصصة للتخريب.",
  subjectChanged: "تم تغيير اسم المجموعة",
  errorOnPlug: "خطأ أثناء التنفيذ",
  errorIsNotGroup: "⚠️ *هذه الأوامر تعمل فقط داخل المجموعات !!*",
  subjectInputError: `⚠️ *اسم المجموعة يجب أن يكون بين 1 و 69 حرفًا !!*`,
  errorSameName: "⚠️ *لا يمكنك استخدام نفس الاسم، جرب اسمًا مختلفًا.*",
  parramsNotFound: "⚠️ *لا توجد إعدادات بهذا الاسم.*",
  errorOnSwicher: "خطأ أثناء تبديل الوضع",
  modeSwitched: "done..",
  adminsDemoted: "done..",
  adminsDemotedSuccessfully: "*done..*",
  groupUnlocked:"اوه",
  groupUnlockedSuccessfully:"*تكلموا يا عبيد..*",
  grouplocked:"كلامكم كثير..",
  grouplockedSuccessfully:"*⛔⛔..؟*"
};

const emojis = {
  error: "🚫",         // خطأ
  success: "✅",       // نجاح
  info: "ℹ️",          // معلومات
  warning: "⚠️",       // تحذير
  loading: "⏳",       // جاري التحميل
  done: "✅",          // تم
  fail: "❌",          // فشل
  bot: "🤖",           // بوت
  down: "⬇️",         // للأسفل
  up: "⬆️",           // للأعلى
  check: "✔️",        // تحقق
  link: "🔗",         // رابط
  empty: "📂",        // فارغ
  mention: "⛔",      // منشن أو إشارة
  params: "⚙️",       // إعدادات
  delete: "🗑️",       // حذف
  lock: "🔒",         // قفل
  unlock: "🔓"         // فتح
};

module.exports = {
  texts,
  emojis,
};